Tekla.Structures.Model.Chamfer.ChamferTypeEnum
The basic shape type of the chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_NONE
No chamfer type.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_LINE
The line type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_ROUNDING
The rounding type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_ARC
The arc type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_ARC_POINT
The arc point type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_SQUARE
The square type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_SQUARE_PARALLEL
The square parallel type chamfer.

Tekla.Structures.Model.Chamfer.ChamferTypeEnum.CHAMFER_LINE_AND_ARC
The line and arc type chamfer.